In [1]:
# SQLLite database created online https://sqliteonline.com and then exported to the same folder

In [2]:
pip install db-sqlite3

Requirement already satisfied: db-sqlite3 in /opt/anaconda3/lib/python3.7/site-packages (0.0.1)
Requirement already satisfied: db in /opt/anaconda3/lib/python3.7/site-packages (from db-sqlite3) (0.1.1)
Requirement already satisfied: antiorm in /opt/anaconda3/lib/python3.7/site-packages (from db->db-sqlite3) (1.2.1)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import sqlite3 as sql
import pandas as pd

In [4]:
database = "sqlite.db"

In [5]:
connection = sql.connect(database)

In [6]:
query = '''SELECT * FROM CARTOONS'''

In [7]:
print(query)

SELECT * FROM CARTOONS

In [8]:
df = pd.read_sql_query(query,connection)
df.head()

  firstname lastname
0     daffy     duck
1    Mickey    Mouse

In [9]:
print(len(df.head()))

2

In [10]:
name = input("Enter a name ")

Enter a name  daffy

In [21]:
new_query = " SELECT firstname FROM CARTOONS WHERE firstname = " + "'"+name+"'"

In [22]:
print(new_query)

 SELECT firstname FROM CARTOONS WHERE firstname = 'daffy'

In [23]:
df = pd.read_sql_query(new_query,connection)
df.head()

  firstname
0     daffy

In [24]:
print(len(df.head()))

1

In [25]:
import sqlite3 as sql
from sqlite3 import Error
def create_connection():
    conn= None
    try:
#        database = "sqlite.db"
        database = "Test.db"
        conn = sql.connect(database)
        
        sql_create_projects_table = """ CREATE TABLE IF NOT EXISTS scores (
                                        firstname text,
                                        secondname text,
                                        score  integer
                                    ); """
        if conn is not None:
        # create projects table
            c = conn.cursor()
            c.execute(sql_create_projects_table)
        else:
            print("Error! cannot create the database connection.")
    except Error as e:
        print(e)
    return conn

In [26]:
Y = create_connection()
print(Y)

<sqlite3.Connection object at 0x122bc92d0>

In [28]:
def create_task(conn, task):
 
    sql = ''' INSERT INTO scores(firstname,secondname,score)
              VALUES(?,?,?) '''
    cur = conn.cursor()
    cur.execute(sql,task)
    return cur.lastrowid

In [29]:
task = ('Alex','Smith',1)
create_task(Y,task)
task = ('May','Taylor',10)
create_task(Y,task)
task=('Jane','Brown',5)
create_task(Y,task)
task = ('Charles','Dickens',99)
create_task(Y,task)
task = ('William','Shakespheare', 101)
create_task(Y,task)
task = ('Florence','Nightingale',200)
create_task(Y,task)

6

In [30]:
def select_all_tasks(conn):
    cur = conn.cursor()
    cur.execute("SELECT * FROM scores ORDER BY score desc limit 5")
 
    rows = cur.fetchall()
 
    for row in rows:
        print(row)

In [31]:
select_all_tasks(Y)

('Florence', 'Nightingale', 200)
('William', 'Shakespheare', 101)
('Charles', 'Dickens', 99)
('May', 'Taylor', 10)
('Jane', 'Brown', 5)